#+TITLE:Literate programming with Emacs and Org-mode
#+AUTHOR:Marcus Birkenkrahe
#+SUBTITLE:
#+STARTUP:overview hideblocks
#+OPTIONS: toc:1 ^:nil
:PROPERTIES:
#+PROPERTY: header-args:C :main yes 
#+PROPERTY: header-args:C :includes <stdio.h>
#+PROPERTY: header-args:C :exports both
#+PROPERTY: header-args:C :results output
#+PROPERTY: header-args:C :comments both
:END:
:REVEAL_PROPERTIES:
#+REVEAL_ROOT: https://cdn.jsdelivr.net/npm/reveal.js
#+REVEAL_REVEAL_JS_VERSION: 4
#+REVEAL_INIT_OPTIONS: slideNumber:true
#+REVEAL_THEME: serif
#+OPTIONS: timestamp:nil toc:1 num:nil
:END:
* Setup

  To make sure that you can run the Org-mode C code blocks, type
  ~CTRL-c~ twice (written ~C-c C-c~) with the cursor anywhere on the code
  block "[[pgm:readme]]":

  #+name: pgm:readme
  #+begin_src C :tangle ../src/readme.c :results outputs :includes <stdio.h.>
    puts("Yes, it works.");
  #+end_src

  #+RESULTS: pgm:readme
  | Yes | it works. |


  Anything else but the output ~Yes, it works~ spells trouble:
  + Check that you have a ~.emacs~ file in ~$HOME~.
  + Check that the ~.emacs~ file contains these lines:

    #+name: ex:emacs
    #+begin_example emacs-lisp
    (org-babel-do-load-languages
    'org-babel-load-languages '((C . t)))
    #+end_example

  + Check that you have GCC or another C compiler installed by
    entering in a terminal: ~gcc --version~. This is what I get:

    #+begin_example bash
    pi@raspberrypi:~$ gcc --version
    gcc (Raspbian 10.2.1-6+rpi1) 10.2.1 20210110
    Copyright (C) 2020 Free Software Foundation, Inc.
    This is free software; see the source for copying conditions.
    #+end_example

  + Check the ~*Messages*~ buffer of this Emacs session for error
    messages

